In [1]:
import pandas as pd
pd.options.display.max_rows = 100
pd.options.display.max_columns = 100

In [2]:
# Read a CSV file into a dataframe
df = pd.read_csv('data/friends.csv')
df

    S.No.       Name  Age City           Email  CitiesLivedInPast
0       1   Abhishek   41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1   41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh   42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando   44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish   42   DL  as12@gmail.com                LKO
5       6     Faheem   41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag   42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep   42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand   42   DB  ak05@gmail.com                HYD
9      10       Deek   40   NJ  dg08@gmail.com             NO;CNB
10     11     Hitesh   40   DB  hp12@gmail.com                NaN
11     12      Roops   41   SY  rr27@gmail.com         LKO;CNB;NO
12     13       Rash   41   DB  rp05@gmail.com                NaN
13     14       Sean   33   SY  sk10@gmail.com                NaN
14     15     Andrew   33   SY  ap21@gmail.com                NaN
15     16    Ishanvi   10   SY  ik09@gmail.com                 NO
16     17      Arjun    5   SY  ak20@gmail.com                NaN
17     18    GrandPa   78   SY  gp00@gmail.com                NaN
18     19    Shivani   41   SY  ss00@gmail.com             LKO;NO

## Update Columns

In [3]:
df.columns

Index(['S.No.', 'Name', 'Age', 'City', 'Email', 'CitiesLivedInPast'], dtype='object')

In [4]:
df.columns = ['S.No.', 'Name', 'Age', 'Current City', 'Email Address', 'CitiesLivedInPast']

In [5]:
df.columns

Index(['S.No.', 'Name', 'Age', 'Current City', 'Email Address',
       'CitiesLivedInPast'],
      dtype='object')

In [6]:
df.columns = [x.upper() for x in df.columns]
df.columns

Index(['S.NO.', 'NAME', 'AGE', 'CURRENT CITY', 'EMAIL ADDRESS',
       'CITIESLIVEDINPAST'],
      dtype='object')

In [7]:
df.columns = df.columns.str.replace(' ', '_')
df.columns

Index(['S.NO.', 'NAME', 'AGE', 'CURRENT_CITY', 'EMAIL_ADDRESS',
       'CITIESLIVEDINPAST'],
      dtype='object')

In [8]:
df.columns = [x.lower() for x in df.columns]
df.columns

Index(['s.no.', 'name', 'age', 'current_city', 'email_address',
       'citieslivedinpast'],
      dtype='object')

In [9]:
df.rename(columns = {'current_city':'city','email_address': 'email'})

    s.no.       name  age city           email  citieslivedinpast
0       1   Abhishek   41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1   41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh   42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando   44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish   42   DL  as12@gmail.com                LKO
5       6     Faheem   41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag   42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep   42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand   42   DB  ak05@gmail.com                HYD
9      10       Deek   40   NJ  dg08@gmail.com             NO;CNB
10     11     Hitesh   40   DB  hp12@gmail.com                NaN
11     12      Roops   41   SY  rr27@gmail.com         LKO;CNB;NO
12     13       Rash   41   DB  rp05@gmail.com                NaN
13     14       Sean   33   SY  sk10@gmail.com                NaN
14     15     Andrew   33   SY  ap21@gmail.com                NaN
15     16    Ishanvi   10   SY  ik09@gmail.com                 NO
16     17      Arjun    5   SY  ak20@gmail.com                NaN
17     18    GrandPa   78   SY  gp00@gmail.com                NaN
18     19    Shivani   41   SY  ss00@gmail.com             LKO;NO

In [10]:
print(df.columns) # changes did not happen, since rename was missing the inplace attribute
df.rename(columns = {'current_city':'city','email_address': 'email'}, inplace = True)
df.columns

Index(['s.no.', 'name', 'age', 'current_city', 'email_address',
       'citieslivedinpast'],
      dtype='object')

Index(['s.no.', 'name', 'age', 'city', 'email', 'citieslivedinpast'], dtype='object')

## Update Rows

In [11]:
df.loc[9] = [10,'Deeksha','40','NJ','dg08@gmail.com','NO;CNB;BLY']
df

    s.no.       name age city           email  citieslivedinpast
0       1   Abhishek  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1  41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish  42   DL  as12@gmail.com                LKO
5       6     Faheem  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand  42   DB  ak05@gmail.com                HYD
9      10    Deeksha  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     Hitesh  40   DB  hp12@gmail.com                NaN
11     12      Roops  41   SY  rr27@gmail.com         LKO;CNB;NO
12     13       Rash  41   DB  rp05@gmail.com                NaN
13     14       Sean  33   SY  sk10@gmail.com                NaN
14     15     Andrew  33   SY  ap21@gmail.com                NaN
15     16    Ishanvi  10   SY  ik09@gmail.com                 NO
16     17      Arjun   5   SY  ak20@gmail.com                NaN
17     18    GrandPa  78   SY  gp00@gmail.com                NaN
18     19    Shivani  41   SY  ss00@gmail.com             LKO;NO

In [12]:
df.loc[11,['name','citieslivedinpast']] = ['Roopali','LKO;CNB;NO;SM']
df

    s.no.       name age city           email  citieslivedinpast
0       1   Abhishek  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1  41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish  42   DL  as12@gmail.com                LKO
5       6     Faheem  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand  42   DB  ak05@gmail.com                HYD
9      10    Deeksha  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     Hitesh  40   DB  hp12@gmail.com                NaN
11     12    Roopali  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13       Rash  41   DB  rp05@gmail.com                NaN
13     14       Sean  33   SY  sk10@gmail.com                NaN
14     15     Andrew  33   SY  ap21@gmail.com                NaN
15     16    Ishanvi  10   SY  ik09@gmail.com                 NO
16     17      Arjun   5   SY  ak20@gmail.com                NaN
17     18    GrandPa  78   SY  gp00@gmail.com                NaN
18     19    Shivani  41   SY  ss00@gmail.com             LKO;NO

In [13]:
filter1 = (df['email'] == 'rp05@gmail.com')
df[filter1]['name']

12    Rash
Name: name, dtype: object

In [14]:
df[filter1]['name'] = 'Rashmi'

/Users/ak670612/python/workspace/venv/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
df.loc[filter1,'name'] = 'Rashmi'
df

    s.no.       name age city           email  citieslivedinpast
0       1   Abhishek  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1  41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish  42   DL  as12@gmail.com                LKO
5       6     Faheem  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand  42   DB  ak05@gmail.com                HYD
9      10    Deeksha  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     Hitesh  40   DB  hp12@gmail.com                NaN
11     12    Roopali  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13     Rashmi  41   DB  rp05@gmail.com                NaN
13     14       Sean  33   SY  sk10@gmail.com                NaN
14     15     Andrew  33   SY  ap21@gmail.com                NaN
15     16    Ishanvi  10   SY  ik09@gmail.com                 NO
16     17      Arjun   5   SY  ak20@gmail.com                NaN
17     18    GrandPa  78   SY  gp00@gmail.com                NaN
18     19    Shivani  41   SY  ss00@gmail.com             LKO;NO

## Multiple Rows

In [16]:
df['name'].str.upper()

0      ABHISHEK
1     ABHISHEK1
2       SAURABH
3         SANDO
4        ASHISH
5        FAHEEM
6        ANURAG
7       PRADEEP
8         ANAND
9       DEEKSHA
10       HITESH
11      ROOPALI
12       RASHMI
13         SEAN
14       ANDREW
15      ISHANVI
16        ARJUN
17      GRANDPA
18      SHIVANI
Name: name, dtype: object

In [17]:
df

    s.no.       name age city           email  citieslivedinpast
0       1   Abhishek  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  Abhishek1  41   AT   ak1@gmail.com            LKO;CHN
2       3    Saurabh  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      Sando  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     Ashish  42   DL  as12@gmail.com                LKO
5       6     Faheem  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     Anurag  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    Pradeep  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      Anand  42   DB  ak05@gmail.com                HYD
9      10    Deeksha  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     Hitesh  40   DB  hp12@gmail.com                NaN
11     12    Roopali  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13     Rashmi  41   DB  rp05@gmail.com                NaN
13     14       Sean  33   SY  sk10@gmail.com                NaN
14     15     Andrew  33   SY  ap21@gmail.com                NaN
15     16    Ishanvi  10   SY  ik09@gmail.com                 NO
16     17      Arjun   5   SY  ak20@gmail.com                NaN
17     18    GrandPa  78   SY  gp00@gmail.com                NaN
18     19    Shivani  41   SY  ss00@gmail.com             LKO;NO

In [18]:
df['name'] = df['name'].str.upper()

In [19]:
df

    s.no.       name age city           email  citieslivedinpast
0       1   ABHISHEK  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  ABHISHEK1  41   AT   ak1@gmail.com            LKO;CHN
2       3    SAURABH  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      SANDO  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     ASHISH  42   DL  as12@gmail.com                LKO
5       6     FAHEEM  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     ANURAG  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    PRADEEP  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      ANAND  42   DB  ak05@gmail.com                HYD
9      10    DEEKSHA  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     HITESH  40   DB  hp12@gmail.com                NaN
11     12    ROOPALI  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13     RASHMI  41   DB  rp05@gmail.com                NaN
13     14       SEAN  33   SY  sk10@gmail.com                NaN
14     15     ANDREW  33   SY  ap21@gmail.com                NaN
15     16    ISHANVI  10   SY  ik09@gmail.com                 NO
16     17      ARJUN   5   SY  ak20@gmail.com                NaN
17     18    GRANDPA  78   SY  gp00@gmail.com                NaN
18     19    SHIVANI  41   SY  ss00@gmail.com             LKO;NO

## apply - applies to every Series object in the dataframe

In [20]:
df['name'].apply(len)

0     8
1     9
2     7
3     5
4     6
5     6
6     6
7     7
8     5
9     7
10    6
11    7
12    6
13    4
14    6
15    7
16    5
17    7
18    7
Name: name, dtype: int64

In [21]:
df

    s.no.       name age city           email  citieslivedinpast
0       1   ABHISHEK  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  ABHISHEK1  41   AT   ak1@gmail.com            LKO;CHN
2       3    SAURABH  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      SANDO  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     ASHISH  42   DL  as12@gmail.com                LKO
5       6     FAHEEM  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     ANURAG  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    PRADEEP  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      ANAND  42   DB  ak05@gmail.com                HYD
9      10    DEEKSHA  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     HITESH  40   DB  hp12@gmail.com                NaN
11     12    ROOPALI  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13     RASHMI  41   DB  rp05@gmail.com                NaN
13     14       SEAN  33   SY  sk10@gmail.com                NaN
14     15     ANDREW  33   SY  ap21@gmail.com                NaN
15     16    ISHANVI  10   SY  ik09@gmail.com                 NO
16     17      ARJUN   5   SY  ak20@gmail.com                NaN
17     18    GRANDPA  78   SY  gp00@gmail.com                NaN
18     19    SHIVANI  41   SY  ss00@gmail.com             LKO;NO

In [22]:
def update_name(name):
    return name.lower()

In [23]:
df['name'].apply(update_name)

0      abhishek
1     abhishek1
2       saurabh
3         sando
4        ashish
5        faheem
6        anurag
7       pradeep
8         anand
9       deeksha
10       hitesh
11      roopali
12       rashmi
13         sean
14       andrew
15      ishanvi
16        arjun
17      grandpa
18      shivani
Name: name, dtype: object

In [24]:
df['name'] = df['name'].apply(update_name)
df

    s.no.       name age city           email  citieslivedinpast
0       1   abhishek  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  abhishek1  41   AT   ak1@gmail.com            LKO;CHN
2       3    saurabh  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      sando  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     ashish  42   DL  as12@gmail.com                LKO
5       6     faheem  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     anurag  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    pradeep  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      anand  42   DB  ak05@gmail.com                HYD
9      10    deeksha  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     hitesh  40   DB  hp12@gmail.com                NaN
11     12    roopali  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13     rashmi  41   DB  rp05@gmail.com                NaN
13     14       sean  33   SY  sk10@gmail.com                NaN
14     15     andrew  33   SY  ap21@gmail.com                NaN
15     16    ishanvi  10   SY  ik09@gmail.com                 NO
16     17      arjun   5   SY  ak20@gmail.com                NaN
17     18    grandpa  78   SY  gp00@gmail.com                NaN
18     19    shivani  41   SY  ss00@gmail.com             LKO;NO

In [25]:
df['name'] = df['name'].apply(lambda x:x.upper())
df

    s.no.       name age city           email  citieslivedinpast
0       1   ABHISHEK  41   SY  ak13@gmail.com          LKO;GR;NO
1       2  ABHISHEK1  41   AT   ak1@gmail.com            LKO;CHN
2       3    SAURABH  42   SY  sk29@gmail.com     LKO;CHN;CAL;NO
3       4      SANDO  44   NO  sd18@gmail.com  LKO;CHN;CAL;NO;GR
4       5     ASHISH  42   DL  as12@gmail.com                LKO
5       6     FAHEEM  41   GR  fs25@gmail.com      LKO;BAN;NO;DL
6       7     ANURAG  42   NO  ak04@gmail.com      LKO;BUB;GR;NO
7       8    PRADEEP  42   PN  pg16@gmail.com      LKO;CHN;GR;PN
8       9      ANAND  42   DB  ak05@gmail.com                HYD
9      10    DEEKSHA  40   NJ  dg08@gmail.com         NO;CNB;BLY
10     11     HITESH  40   DB  hp12@gmail.com                NaN
11     12    ROOPALI  41   SY  rr27@gmail.com      LKO;CNB;NO;SM
12     13     RASHMI  41   DB  rp05@gmail.com                NaN
13     14       SEAN  33   SY  sk10@gmail.com                NaN
14     15     ANDREW  33   SY  ap21@gmail.com                NaN
15     16    ISHANVI  10   SY  ik09@gmail.com                 NO
16     17      ARJUN   5   SY  ak20@gmail.com                NaN
17     18    GRANDPA  78   SY  gp00@gmail.com                NaN
18     19    SHIVANI  41   SY  ss00@gmail.com             LKO;NO

In [26]:
df.apply(len) # the length function is applied to each series object - rows count

s.no.                19
name                 19
age                  19
city                 19
email                19
citieslivedinpast    19
dtype: int64

In [27]:
df.apply(len, axis =1) # the length function is applied to each series object - column count

0     6
1     6
2     6
3     6
4     6
5     6
6     6
7     6
8     6
9     6
10    6
11    6
12    6
13    6
14    6
15    6
16    6
17    6
18    6
dtype: int64

In [28]:
df.apply(lambda x: x + x) # the apply is applied to every element in the DF since no particular row or column was specified.

,s.no.,name,age,city,email,citieslivedinpast
0,2,ABHISHEKABHISHEK,82,SYSY,ak13@gmail.comak13@gmail.com,LKO;GR;NOLKO;GR;NO
1,4,ABHISHEK1ABHISHEK1,82,ATAT,ak1@gmail.comak1@gmail.com,LKO;CHNLKO;CHN
2,6,SAURABHSAURABH,84,SYSY,sk29@gmail.comsk29@gmail.com,LKO;CHN;CAL;NOLKO;CHN;CAL;NO
3,8,SANDOSANDO,88,NONO,sd18@gmail.comsd18@gmail.com,LKO;CHN;CAL;NO;GRLKO;CHN;CAL;NO;GR
4,10,ASHISHASHISH,84,DLDL,as12@gmail.comas12@gmail.com,LKOLKO
5,12,FAHEEMFAHEEM,82,GRGR,fs25@gmail.comfs25@gmail.com,LKO;BAN;NO;DLLKO;BAN;NO;DL
6,14,ANURAGANURAG,84,NONO,ak04@gmail.comak04@gmail.com,LKO;BUB;GR;NOLKO;BUB;GR;NO
7,16,PRADEEPPRADEEP,84,PNPN,pg16@gmail.compg16@gmail.com,LKO;CHN;GR;PNLKO;CHN;GR;PN
8,18,ANANDANAND,84,DBDB,ak05@gmail.comak05@gmail.com,HYDHYD
9,20,DEEKSHADEEKSHA,4040,NJNJ,dg08@gmail.comdg08@gmail.com,NO;CNB;BLYNO;CNB;BLY
10,22,HITESHHITESH,80,DBDB,hp12@gmail.comhp12@gmail.com,NaN
11,24,ROOPALIROOPALI,82,SYSY,rr27@gmail.comrr27@gmail.com,LKO;CNB;NO;SMLKO;CNB;NO;SM
12,26,RASHMIRASHMI,82,DBDB,rp05@gmail.comrp05@gmail.com,NaN
13,28,SEANSEAN,66,SYSY,sk10@gmail.comsk10@gmail.com,NaN
14,30,ANDREWANDREW,66,SYSY,ap21@gmail.comap21@gmail.com,NaN
15,32,ISHANVIISHANVI,20,SYSY,ik09@gmail.comik09@gmail.com,NONO
16,34,ARJUNARJUN,10,SYSY,ak20@gmail.comak20@gmail.com,NaN
17,36,GRANDPAGRANDPA,156,SYSY,gp00@gmail.comgp00@gmail.com,NaN
18,38,SHIVANISHIVANI,82,SYSY,ss00@gmail.comss00@gmail.com,LKO;NOLKO;NO

In [29]:
dfnew  = df[['name', 'city','email']]
dfnew

         name city           email
0    ABHISHEK   SY  ak13@gmail.com
1   ABHISHEK1   AT   ak1@gmail.com
2     SAURABH   SY  sk29@gmail.com
3       SANDO   NO  sd18@gmail.com
4      ASHISH   DL  as12@gmail.com
5      FAHEEM   GR  fs25@gmail.com
6      ANURAG   NO  ak04@gmail.com
7     PRADEEP   PN  pg16@gmail.com
8       ANAND   DB  ak05@gmail.com
9     DEEKSHA   NJ  dg08@gmail.com
10     HITESH   DB  hp12@gmail.com
11    ROOPALI   SY  rr27@gmail.com
12     RASHMI   DB  rp05@gmail.com
13       SEAN   SY  sk10@gmail.com
14     ANDREW   SY  ap21@gmail.com
15    ISHANVI   SY  ik09@gmail.com
16      ARJUN   SY  ak20@gmail.com
17    GRANDPA   SY  gp00@gmail.com
18    SHIVANI   SY  ss00@gmail.com

In [30]:
dfnew['email'].apply(len)

0     14
1     13
2     14
3     14
4     14
5     14
6     14
7     14
8     14
9     14
10    14
11    14
12    14
13    14
14    14
15    14
16    14
17    14
18    14
Name: email, dtype: int64

In [31]:
dfnew.apply(len)

name     19
city     19
email    19
dtype: int64

In [32]:
dfnew.apply(len, axis = 'columns')

0     3
1     3
2     3
3     3
4     3
5     3
6     3
7     3
8     3
9     3
10    3
11    3
12    3
13    3
14    3
15    3
16    3
17    3
18    3
dtype: int64

In [33]:
dfnew.apply(pd.Series.min)

name           ABHISHEK
city                 AT
email    ak04@gmail.com
dtype: object

In [34]:
dfnew.apply(lambda x: x.max())

name            SHIVANI
city                 SY
email    ss00@gmail.com
dtype: object

### applymap -  applies only to Dataframes and not to series objects. Applies to every item in the DataFrame.

In [35]:
dfnew.applymap(len)

    name  city  email
0      8     2     14
1      9     2     13
2      7     2     14
3      5     2     14
4      6     2     14
5      6     2     14
6      6     2     14
7      7     2     14
8      5     2     14
9      7     2     14
10     6     2     14
11     7     2     14
12     6     2     14
13     4     2     14
14     6     2     14
15     7     2     14
16     5     2     14
17     7     2     14
18     7     2     14

In [36]:
dfnew.applymap(max)

   name city email
0     S    Y     o
1     S    T     o
2     U    Y     s
3     S    O     s
4     S    L     s
5     M    R     s
6     U    O     o
7     R    P     p
8     N    D     o
9     S    N     o
10    T    D     p
11    R    Y     r
12    S    D     r
13    S    Y     s
14    W    Y     p
15    V    Y     o
16    U    Y     o
17    R    Y     p
18    V    Y     s

In [37]:
dfnew1 = dfnew.applymap(str.lower)
dfnew1

         name city           email
0    abhishek   sy  ak13@gmail.com
1   abhishek1   at   ak1@gmail.com
2     saurabh   sy  sk29@gmail.com
3       sando   no  sd18@gmail.com
4      ashish   dl  as12@gmail.com
5      faheem   gr  fs25@gmail.com
6      anurag   no  ak04@gmail.com
7     pradeep   pn  pg16@gmail.com
8       anand   db  ak05@gmail.com
9     deeksha   nj  dg08@gmail.com
10     hitesh   db  hp12@gmail.com
11    roopali   sy  rr27@gmail.com
12     rashmi   db  rp05@gmail.com
13       sean   sy  sk10@gmail.com
14     andrew   sy  ap21@gmail.com
15    ishanvi   sy  ik09@gmail.com
16      arjun   sy  ak20@gmail.com
17    grandpa   sy  gp00@gmail.com
18    shivani   sy  ss00@gmail.com

### Map - works only on the Series object

In [38]:
dfnew2 = dfnew1['city'].map({'sy':'Sunnyvale', 'at':'Atlanta','no':'Noida','dl':'Delhi','gr':'Gurugram','pn':'Pune','db':'Dublin'})

In [39]:
dfnew2 # nj is converted to Nan

0     Sunnyvale
1       Atlanta
2     Sunnyvale
3         Noida
4         Delhi
5      Gurugram
6         Noida
7          Pune
8        Dublin
9           NaN
10       Dublin
11    Sunnyvale
12       Dublin
13    Sunnyvale
14    Sunnyvale
15    Sunnyvale
16    Sunnyvale
17    Sunnyvale
18    Sunnyvale
Name: city, dtype: object

In [40]:
dfnew3 = dfnew1['city'].replace({'sy':'Sunnyvale', 'at':'Atlanta','no':'Noida','dl':'Delhi','gr':'Gurugram','pn':'Pune','db':'Dublin'})
dfnew3 # nj is not converted

0     Sunnyvale
1       Atlanta
2     Sunnyvale
3         Noida
4         Delhi
5      Gurugram
6         Noida
7          Pune
8        Dublin
9            nj
10       Dublin
11    Sunnyvale
12       Dublin
13    Sunnyvale
14    Sunnyvale
15    Sunnyvale
16    Sunnyvale
17    Sunnyvale
18    Sunnyvale
Name: city, dtype: object